#+title: Listning 3
*** Решение
Получаем три аргумента, кладем на стек как локальные переменные
cmp arg1, 0 if t => .LC0 => ret
cmp arg2, 0 if t => .LC0 => ret
cmp arg3, 0 if t => .LCO => ret
else .L3
arg1 + arg2 - arg 3 = rbp-4
cmp rbp-4, 0
if L3_res > 0 => .L5
 L5_res = L3_res shr 31 = 0 ; Shift logical right = логический сдвиг вправо на 31, младший бит выбрасывается, старший заполняется 0, соответственно останется только старший бит который стоит на месте младшего, он может быть 0 или 1, так как была проверка результата на > 0 то число положительное и старший бит = 0
 res = L3_res + L5_res = L3_res + 0/1, но из-за jg в .L3 L5_res = 0
 sar res  ; Shift arithmetical right = арифметический сдвиг вправо, младший бит выбрасывается, старший заполняется в соответствии со знаком числа и в случае положительного значения равно делению на 2**n n=число сдвигов с округлением к 0, в случае отрицательного деление с округлением вниз
 res = res / 2
 Елси бы не проверка на отрицательность в блоке .L3 то это было бы универсальное деление на 2 с округлением к 0
 (x + (x < 0 ? 1 : 0)) >> 1

#+begin_src C :results output
#include <stdio.h>
int main() {
    int arg1 = -1;
    int arg2 = 5;
    int arg3 = 3;
    if (arg1 == 0 || arg2 == 0 || arg3 == 0) {
        printf("[ ! ] Invalid input!");
    } else {
      int sum = arg1 + arg2 - arg3;
      if (sum > 0) {
        int res = (sum + (sum < 0 ? 1 : 0)) >> 1;
        printf("%d", res);
      } else {
        printf("[ ! ] Value less or equal to zero!");
      }
    }
    return 0;
}
#+end_src
#+RESULTS:
: 0

